// Напишите программу, которая на входе принимает число а выдает его квадрат.
// пример
// 4 -> 16
// -3-> 9
// -7-> 49


Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number*number);
